//Завдання 3 пункт 1 варіант 13
//Програму організувати таким чином, щоб користувач міг задавати номер задачі, 
//яку хоче запустити на виконання(це можна реалізувати або за допомогою оператора вибору, або безумовного переходу)
//1.Дано натуральне число n і цілі числа a1, a2, …, an.Знайти кількість пар «сусідніх» чисел ai, які закінчуються на цифру 5.

#include<iostream>
#include<Windows.h>

using namespace std;

int main()
{
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);

    int n;
    int index = 0;

    cout << "Введіть число n: ";
    cin >> n;

    for (int i = 1; i <= n; i++)
    {
        if (i % 5 == 0)
        {
            index++;
        }
    }
    cout << "Кількість цифр, які закінчуються на 5: " << index;
}